package NestedLoops;

public class zad2 {
    public static void main(String[] args) {
//Напишете програма, която чете от конзолата две шестцифрени цели числа в диапазона от 100000 до 300000. Винаги първото въведено число ще бъде по малко от второто.
// На конзолата да се отпечатат на 1 ред разделени с интервал всички числа, които се намират между двете, прочетени от конзолата числа и отговарят на следното условие:
//•	сумата от цифрите на четни и нечетни позиции да са равни. Ако няма числа, отговарящи на условието на конзолата не се извежда резултат.






    }


}
































//
//        int sum = 0;
//
//        for (int i = 1; i <= 1000; i++) {
//
//            int j = i * 10;
//
//            sum += j;
//
//
//        }
//
//        System.out.println(sum);
//        System.out.println(sum / 1000);
