//package WhileLoops;
//
//import java.util.Scanner;
//
//public class zad5 {
//
//    public static void main(String[] args) {
//
//        Scanner scanner = new Scanner(System.in);
//
////        Производителите на вендинг машини искали да направят машините си да връщат възможно най-малко монети ресто. Напишете програма, която приема сума
////        - рестото, което трябва да се върне и изчислява с колко най-малко монети може да стане това.
////Примерен вход и изход
////Вход	Изход	Обяснения
////1.23	4	Рестото ни е 1 лев и 23 стотинки. Машината ни го връща с 4 монети: монета от 1 лев, монета от 20 стотинки, монета от 2 стотинки и монета от 1 стотинка.
////2 	1	Рестото ни е 2 лева. Машината ни го връща с 1 монета от 2 лева.
////0.56	3	Рестото ни е 56 стотинки. Машината ни го връща с 3 монети: монета от 50 стотинки, монета от 5 стотинки и монета от 1 стотинка.
////2.73	5	Рестото ни е 2 лева и 73 стотинки. Машината ни го връща с 5 монети: монета от 2 лева, монета от 50 стотинки, монета от 20 стотинки,
//// монета от 2 стотинки и монета от 1 стотинка.
//
//        double resto = Double.parseDouble(scanner.nextLine());
//        int moneti;
//        double ostatuk;
//
//
//        while (ostatuk != 0) {
//
//            moneti = (int) (resto / 2);
//            ostatuk = resto % 2;
//
//
//
//
//        }
//
//
////        System.out.println(moneti);
//
//
////        while (ostatuk != 0) {
////
////
//////            ostatuk = resto % n;
////
////        }
//
//
////        moneti = (int) (resto / 2);
////        ostatuk = resto % 2.0;
////
////        ostatuk = ostatuk % 1;
////        moneti++;
////
////        ostatuk = ostatuk % 0.50;
////        moneti++;
////
////        ostatuk = ostatuk % 0.2;
////        moneti++;
//
//
////        if ((resto % 2)  )
//
//
////        double x = 1;
////        while (x != 0) {
////            if ((resto % 1) != 0) {
////                x = (resto % 1);
////            }
////            transaccii++;
////            return;
////        }
////        System.out.println(transaccii);
//
//
//    }
//
//
//}
